jenslam/HomeKey-ESP32-1wire-lox/main/NfcManager.cpp
#include "NfcManager.hpp"
#include "DDKReaderData.h"
#include "ReaderDataManager.hpp"
#include "esp32-hal.h"
#include "eventStructs.hpp"
#include "fmt/ranges.h"
#include "freertos/idf_additions.h"
#include "DDKAuthContext.h"
#include "Pn532Reader.hpp"
#include "Pn7160Reader.hpp"
#include "utils.hpp"

#include <array>
#include <esp_log.h>
#include <chrono>
#include <functional>
#include <serialization.hpp>

const char* NfcManager::TAG = "NfcManager";


/**
 * @brief Task entry wrapper that invokes an instance's auth precompute task.
 *
 * For use as a C-style task entry point; casts the provided task parameter to
 * an NfcManager pointer and calls its authPrecomputeTask method.
 *
 * @param instance Pointer to the NfcManager instance passed as the task parameter.
 */
void NfcManager::authPrecomputeTaskEntry(void* instance) {
  static_cast<NfcManager*>(instance)->authPrecomputeTask();
}

void NfcManager::initAuthPrecompute() {
  if (m_authCtxFreeQueue || m_authCtxReadyQueue || m_authPrecomputeTaskHandle) {
    return;
  }

  m_authCtxFreeQueue = xQueueCreate(kAuthCtxPoolSize, sizeof(AuthCtxCacheItem*));
  m_authCtxReadyQueue = xQueueCreate(kAuthCtxCacheSize, sizeof(AuthCtxCacheItem*));
  if (!m_authCtxFreeQueue || !m_authCtxReadyQueue) {
    ESP_LOGE(TAG, "Failed to create auth precompute queues.");
    if (m_authCtxFreeQueue) {
      vQueueDelete(m_authCtxFreeQueue);
      m_authCtxFreeQueue = nullptr;
    }
    if (m_authCtxReadyQueue) {
      vQueueDelete(m_authCtxReadyQueue);
      m_authCtxReadyQueue = nullptr;
    }
    return;
  }

  for (size_t i = 0; i < kAuthCtxPoolSize; i++) {
    m_authPool[i].nfcFn = [this](std::vector<uint8_t>& send, std::vector<uint8_t>& recv, bool isLong) -> bool {
      if (!m_reader || send.size() > 255) {
        return false;
      }
      return m_reader->exchangeApdu(send, recv, isLong ? 1000 : 500);
    };
    m_authPool[i].saveFn = [this](const readerData_t& data) {
      m_readerDataManager.updateReaderData(data);
      // Reader data changed (e.g., new persistent key / endpoint). Drop any cached contexts.
      invalidateAuthCache();
    };
    AuthCtxCacheItem* item = &m_authPool[i];
    xQueueSend(m_authCtxFreeQueue, &item, 0);
  }

  BaseType_t ok = xTaskCreateUniversal(authPrecomputeTaskEntry, "hk_auth_precompute", 4096, this, 3, &m_authPrecomputeTaskHandle, 0);
  if (ok != pdPASS || !m_authPrecomputeTaskHandle) {
    ESP_LOGE(TAG, "Failed to start auth precompute task.");
    m_authPrecomputeTaskHandle = nullptr;
    vQueueDelete(m_authCtxFreeQueue);
    m_authCtxFreeQueue = nullptr;
    vQueueDelete(m_authCtxReadyQueue);
    m_authCtxReadyQueue = nullptr;
    return;
  }

  ESP_LOGI(TAG, "Auth precompute enabled (cache=%u, pool=%u).", kAuthCtxCacheSize, kAuthCtxPoolSize);
}

void NfcManager::invalidateAuthCache() {
  if (!m_hkAuthPrecomputeEnabled) {
    return;
  }
  m_readerDataGeneration.fetch_add(1, std::memory_order_relaxed);

  if (!m_authCtxReadyQueue || !m_authCtxFreeQueue) {
    return;
  }

  AuthCtxCacheItem* item = nullptr;
  uint32_t invalidatedCount = 0;
  while (xQueueReceive(m_authCtxReadyQueue, &item, 0) == pdTRUE) {
    if (!item) continue;
    delete item->ctx;
    item->ctx = nullptr;
    xQueueSend(m_authCtxFreeQueue, &item, 0);
    invalidatedCount++;
  }

  if (invalidatedCount > 0) {
    ESP_LOGI(TAG, "Auth cache invalidated (%u items).", invalidatedCount);
  }
  if (m_authPrecomputeTaskHandle) {
    xTaskNotifyGive(m_authPrecomputeTaskHandle);
  }
}

void NfcManager::authPrecomputeTask() {
  ESP_LOGI(TAG, "Auth precompute task started.");
  while (true) {
    if (!m_authCtxFreeQueue || !m_authCtxReadyQueue) {
      vTaskDelay(pdMS_TO_TICKS(1000));
      continue;
    }

    const UBaseType_t readyCount = uxQueueMessagesWaiting(m_authCtxReadyQueue);
    if (readyCount >= kAuthCtxCacheSize) {
      ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(1000));
      continue;
    }

    AuthCtxCacheItem* item = nullptr;
    if (xQueueReceive(m_authCtxFreeQueue, &item, pdMS_TO_TICKS(1000)) != pdTRUE || !item) {
      ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(1000));
      continue;
    }

    readerData_t snapshot = m_readerDataManager.getReaderDataCopy();
    const bool provisioned =
      snapshot.reader_gid.size() == 8 &&
      !snapshot.reader_id.empty() &&
      !snapshot.reader_sk.empty() &&
      !snapshot.reader_pk.empty();

    if (!provisioned) {
      ESP_LOGD(TAG, "Auth precompute: reader not provisioned yet, retrying...");
      xQueueSend(m_authCtxFreeQueue, &item, 0);
      ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(1000));
      continue;
    }

    delete item->ctx;
    item->ctx = nullptr;
    item->readerData = std::move(snapshot);
    item->generation = m_readerDataGeneration.load(std::memory_order_relaxed);

    ESP_LOGI(TAG, "Auth precompute: generating (gen=%u, free=%u, ready=%u)...",
             item->generation,
             uxQueueMessagesWaiting(m_authCtxFreeQueue),
             uxQueueMessagesWaiting(m_authCtxReadyQueue));

    auto startTime = std::chrono::high_resolution_clock::now();
    item->ctx = new (std::nothrow) DDKAuthenticationContext(kHomeKey, item->nfcFn, item->readerData, item->saveFn);
    auto stopTime = std::chrono::high_resolution_clock::now();
    const auto durationMs =
        std::chrono::duration_cast<std::chrono::milliseconds>(stopTime - startTime).count();

    if (!item->ctx) {
      ESP_LOGE(TAG, "Auth precompute: allocation failed.");
      xQueueSend(m_authCtxFreeQueue, &item, 0);
      vTaskDelay(pdMS_TO_TICKS(250));
      continue;
    }

    const uint32_t genAfter = m_readerDataGeneration.load(std::memory_order_relaxed);
    if (item->generation != genAfter) {
      ESP_LOGI(TAG, "Auth precompute: stale during generation (itemGen=%u, genNow=%u), retrying...",
               item->generation,
               genAfter);
      delete item->ctx;
      item->ctx = nullptr;
      xQueueSend(m_authCtxFreeQueue, &item, 0);
      continue;
    }

    if (xQueueSend(m_authCtxReadyQueue, &item, 0) != pdTRUE) {
      ESP_LOGW(TAG, "Auth precompute: cache is full unexpectedly, dropping context.");
      delete item->ctx;
      item->ctx = nullptr;
      xQueueSend(m_authCtxFreeQueue, &item, 0);
      continue;
    }

    ESP_LOGI(TAG, "Auth precompute: ready in %lli ms (gen=%u, free=%u, ready=%u)",
             durationMs,
             item->generation,
             uxQueueMessagesWaiting(m_authCtxFreeQueue),
             uxQueueMessagesWaiting(m_authCtxReadyQueue));
  }
}

/**
 * @brief Construct and initialize an NfcManager, set up ECP data and event wiring.
 *
 * Initializes internal state, registers the NFC bus topic, and subscribes to HomeKit/internal
 * events so that ACCESSDATA_CHANGED updates ECP data and invalidates the auth cache, and
 * DEBUG_AUTH_FLOW updates the debug authentication flow when received.
 *
 * @param readerDataManager Reference to the ReaderDataManager used to read and persist reader data.
 * @param nfcGpioPins Four GPIO pin numbers used for SPI communication (SS/CS, SCK, MISO, MOSI).
 * @param nfcReaderType 0 = PN532, 1 = PN7160.
 * @param nfcIrqPin IRQ pin for PN7160 (255 = unset).
 * @param nfcVenPin VEN pin for PN7160 (255 = unset).
 * @param hkAuthPrecomputeEnabled If true, enables HomeKit authentication precompute behavior.
 * @param nfcFastPollingEnabled If true, shortens the delay between polling iterations.
 */
NfcManager::NfcManager(ReaderDataManager& readerDataManager,
                       const std::array<uint8_t, 4> &nfcGpioPins,
                       uint8_t nfcReaderType,
                       uint8_t nfcIrqPin,
                       uint8_t nfcVenPin,
                       bool hkAuthPrecomputeEnabled,
                       bool nfcFastPollingEnabled)
    : nfcGpioPins(nfcGpioPins),
      m_nfcReaderType(nfcReaderType),
      m_nfcIrqPin(nfcIrqPin),
      m_nfcVenPin(nfcVenPin),
      m_readerDataManager(readerDataManager),
      m_hkAuthPrecomputeEnabled(hkAuthPrecomputeEnabled),
      m_nfcFastPollingEnabled(nfcFastPollingEnabled),
      m_pollingTaskHandle(nullptr),
      m_retryTaskHandle(nullptr),
      m_ecpData({ 0x6A, 0x2, 0xCB, 0x2, 0x6, 0x2, 0x11, 0x0 })
{
  m_hk_event = AppEventLoop::subscribe(HK_EVENT, HK_INTERNAL_EVENT, [&](const uint8_t* data, size_t size){
    if(size == 0 || data == nullptr) return;
    std::span<const uint8_t> payload(data, size);
    std::error_code ec;
    HomekitEvent hk_event = alpaca::deserialize<HomekitEvent>(payload, ec);
    if(ec) { ESP_LOGE(TAG, "Failed to deserialize HomeKit event: %s", ec.message().c_str()); return; }
    switch(hk_event.type) {
      case ACCESSDATA_CHANGED: {
        updateEcpData();
        invalidateAuthCache();
      }
      break;
      case DEBUG_AUTH_FLOW: {
        EventValueChanged s = alpaca::deserialize<EventValueChanged>(hk_event.data, ec);
        if(!ec){
          authFlow = KeyFlow(s.newValue);
        } else {
          ESP_LOGE(TAG, "Failed to deserialize debug auth flow event: %s", ec.message().c_str());
          return;
        }
      }
      break;
      default:
        break;
    }
  });
}

/**
 * @brief Initialize the selected NFC reader and start the NFC polling task.
 *
 * Instantiates the correct reader implementation (PN532 or PN7160) and launches
 * the background task that drives NFC polling.
 *
 * @return `true` if the NFC polling task was started, `false` otherwise.
 */
bool NfcManager::begin() {
    if (m_nfcReaderType == 0) {
        m_reader = std::make_unique<Pn532Reader>(nfcGpioPins);
        ESP_LOGI(TAG, "Using PN532 reader.");
    } else {
        m_reader = std::make_unique<Pn7160Reader>(nfcGpioPins, m_nfcIrqPin, m_nfcVenPin);
        ESP_LOGI(TAG, "Using PN7160 reader.");
    }
    if (m_hkAuthPrecomputeEnabled) {
        initAuthPrecompute();
    } else {
        ESP_LOGI(TAG, "Auth precompute disabled.");
    }
    ESP_LOGI(TAG, "NFC fast polling: %s", m_nfcFastPollingEnabled ? "enabled" : "disabled");
    ESP_LOGI(TAG, "Starting NFC polling task...");
    xTaskCreateUniversal(pollingTaskEntry, "nfc_poll_task", 8192, this, 4, &m_pollingTaskHandle, 1);
    return true;
}

/**
 * @brief Update the internal ECP data buffer with the reader GID and its CRC16.
 *
 * If the Reader GID is 8 bytes long, copies it into bytes 8–15 of the internal
 * ECP buffer and computes a CRC16 over the first 16 bytes, storing the 2-byte
 * CRC at bytes 16–17 of the buffer. If the Reader GID is not provisioned,
 * logs a warning and leaves the ECP buffer unchanged.
 */
void NfcManager::updateEcpData() {
    const auto readerData = m_readerDataManager.getReaderDataCopy();
    const auto& readerGid = readerData.reader_gid;
    if (readerGid.size() == 8) {
        memcpy(m_ecpData.data() + 8, readerGid.data(), 8);
        Utils::crc16a(m_ecpData.data(), 16, m_ecpData.data() + 16);
    } else {
        ESP_LOGW(TAG, "Reader GID is not provisioned. ECP data may be invalid.");
    }
}

/**
 * @brief Initialize the selected NFC reader and refresh ECP data.
 *
 * Delegates to the active reader's init() method. On success, updates the manager's
 * ECP data buffer.
 *
 * @return `true` if the reader was successfully initialized and ECP data updated, `false` otherwise.
 */
bool NfcManager::initializeReader() {
    if (!m_reader) {
        ESP_LOGE(TAG, "No reader instance available.");
        return false;
    }
    bool ok = m_reader->init();
    if (!ok) {
        ESP_LOGE(TAG, "Reader initialization failed.");
        return false;
    }
    ESP_LOGI(TAG, "Reader initialized. Waiting for tags...");
    updateEcpData();
    return true;
}

/**
 * @brief Starts the NFC reconnection retry task if it is not already running.
 *
 * Creates and stores a task handle for the background retry loop; if a retry task
 * is already active, this function returns without side effects.
 */
void NfcManager::startRetryTask() {
    if (m_retryTaskHandle == nullptr) {
        xTaskCreateUniversal(retryTaskEntry, "nfc_retry_task", 4096, this, 5, &m_retryTaskHandle, 1);
    }
}

/**
 * @brief FreeRTOS task entry that dispatches to an instance's polling loop.
 *
 * This static function is used as a task entry point and calls the associated
 * NfcManager instance's pollingTask method.
 *
 * @param instance Pointer to the NfcManager instance whose pollingTask will be executed.
 */
void NfcManager::pollingTaskEntry(void* instance) {
    static_cast<NfcManager*>(instance)->pollingTask();
}

/**
 * @brief RTOS task entry point for the NFC retry task.
 *
 * This function is the C-style entry invoked by the RTOS; it expects a pointer
 * to an NfcManager instance (passed as void*) and transfers control to that
 * instance's retry task implementation.
 *
 * @param instance Pointer to an NfcManager instance, provided by the RTOS task creation call.
 */
void NfcManager::retryTaskEntry(void* instance) {
    static_cast<NfcManager*>(instance)->retryTask();
}

/**
 * @brief Continuously attempts to reconnect to the NFC reader and restores normal polling on success.
 *
 * Repeatedly calls reader initialization until it succeeds. When the reader is reinitialized,
 * the method resumes the polling task if present, clears the retry task handle, and terminates
 * the current retry task. On failure, it waits 5 seconds before trying again.
 */
void NfcManager::retryTask() {
    ESP_LOGI(TAG, "Starting NFC reconnection task...");
    while (true) {
        if (initializeReader()) {
            ESP_LOGI(TAG, "Reader reconnected successfully.");
            if (m_pollingTaskHandle) vTaskResume(m_pollingTaskHandle);
            m_retryTaskHandle = nullptr;
            vTaskDelete(NULL);
        }
        ESP_LOGW(TAG, "Reconnect attempt failed. Retrying in 5 seconds...");
        vTaskDelay(pdMS_TO_TICKS(5000));
    }
}

/**
 * @brief Main NFC polling loop that monitors the reader and dispatches tag handling.
 *
 * @details Initializes the NFC reader and then runs indefinitely, repeatedly
 * checking the reader's responsiveness and polling for passive ISO14443A tags.
 * If the reader becomes unresponsive, this task schedules a reconnection retry
 * and suspends itself. When a tag is detected, it invokes the tag handling path
 * and waits for the tag to be removed before continuing normal polling.
 */
void NfcManager::pollingTask() {
    if (!initializeReader()) {
      startRetryTask();
      vTaskSuspend(NULL);
    }

    if (!m_reader) {
        ESP_LOGE(TAG, "Reader not available for polling.");
        startRetryTask();
        vTaskSuspend(NULL);
    }

    if (!m_reader->beginDiscovery()) {
        ESP_LOGE(TAG, "Failed to start NFC discovery.");
        startRetryTask();
        vTaskSuspend(NULL);
    }

    const uint16_t passiveTargetTimeoutMs = 500;
    const TickType_t pollDelayTicks =
        pdMS_TO_TICKS(m_nfcFastPollingEnabled ? 5 : 100);

