jenslam/HomeKey-ESP32-1wire-lox/main/NfcManager.cpp
    AuthCtxCacheItem* item = nullptr;
    bool gotCached = false;
    if (m_authCtxReadyQueue && xQueueReceive(m_authCtxReadyQueue, &item, 0) == pdTRUE) {
      if (item && item->ctx) {
        gotCached = true;
      } else if (item) {
        ESP_LOGW(TAG, "Auth cache item dequeued without context, returning to free queue.");
        if (m_authCtxFreeQueue) {
          xQueueSend(m_authCtxFreeQueue, &item, 0);
        }
        item = nullptr;
      }
    }

    if (gotCached) {
      const bool genMatch = (item->generation == genNow);
      if (!genMatch) {
        ESP_LOGW(TAG, "Auth cache stale (itemGen=%u, genNow=%u) -> cold init.", item->generation, genNow);
        delete item->ctx;
        item->ctx = nullptr;
        xQueueSend(m_authCtxFreeQueue, &item, 0);
        item = nullptr;
      } else {
        const UBaseType_t readyAfter = uxQueueMessagesWaiting(m_authCtxReadyQueue);
        const UBaseType_t freeAfter = m_authCtxFreeQueue ? uxQueueMessagesWaiting(m_authCtxFreeQueue) : 0;
        ESP_LOGI(TAG, "Auth cache hit (gen=%u, free=%u->%u, ready=%u->%u).",
                 genNow, freeBefore, freeAfter, readyBefore, readyAfter);
        if (m_authPrecomputeTaskHandle) {
          xTaskNotifyGive(m_authPrecomputeTaskHandle);
        }

        auto authResult = item->ctx->authenticate(authFlow);
        const auto readerId = item->readerData.reader_id;
        delete item->ctx;
        item->ctx = nullptr;
        xQueueSend(m_authCtxFreeQueue, &item, 0);
        publishAuthResult(authResult, readerId);
        return;
      }
    }

    ESP_LOGI(TAG, "Auth cache miss (gen=%u, free=%u, ready=%u) -> cold init.", genNow, freeBefore, readyBefore);
    if (m_authPrecomputeTaskHandle) {
      xTaskNotifyGive(m_authPrecomputeTaskHandle);
    }
    authenticateCold();
}

/**
 * @brief Publish a TAG_TAP NFC event for a detected non-HomeKey (generic) tag.
 *
 * Constructs an EventTagTap containing the tag UID, ATQA, and SAK, serializes it
 * into an NfcEvent payload, and publishes the serialized event to the NFC event
 * topic.
 */
void NfcManager::handleGenericTag(const std::vector<uint8_t>& uid, const std::array<uint8_t,2>& atqa, const uint8_t& sak) {
    EventTagTap s{.uid = uid, .atqa = atqa, .sak = sak};
    std::vector<uint8_t> d;
    alpaca::serialize(s, d);
    NfcEvent event{.type=TAG_TAP, .data=d};
    std::vector<uint8_t> event_data;
    alpaca::serialize(event, event_data);
    AppEventLoop::publish(NFC_EVENT, NFC_TAP_EVENT, event_data.data(), event_data.size());
}
